vllm-bench-tpu/bench-results/20260426-222601-gemma4-tpu/bench-short-rate8.log
INFO 04-26 22:57:07 [__init__.py:59] TPU info: node_name=vllm-bench-tpu-v6e-4 | tpu_type=v6e-4 | worker_id=0 | num_chips=4 | num_cores_per_chip=1
WARNING:absl:Tensorflow library not found, tensorflow.io.gfile operations will use native shim calls. GCS paths (i.e. 'gs://...') cannot be accessed.
INFO 04-26 22:57:10 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 04-26 22:57:10 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 04-26 22:57:10 [interface.py:229] Failed to import from vllm._C: ModuleNotFoundError("No module named 'vllm._C'")
INFO 04-26 22:57:11 [tpu_platform.py:105] Automatically using fp8_e5m2 for FP8 KV cache on TPU v6e.
INFO 04-26 22:57:11 [tpu_platform.py:105] Automatically using fp8_e5m2 for FP8 KV cache on TPU v6e.
INFO 04-26 22:57:11 [tpu_platform.py:105] Automatically using fp8_e5m2 for FP8 KV cache on TPU v6e.
[...]
WARNING 04-26 22:57:12 [__init__.py:81] The quantization method 'awq' already exists and will be overwritten by the quantization config <class 'tpu_inference.layers.vllm.quantization.awq.VllmAWQConfig'>.
WARNING 04-26 22:57:12 [__init__.py:81] The quantization method 'compressed-tensors' already exists and will be overwritten by the quantization config <class 'tpu_inference.layers.vllm.quantization.compressed_tensors.compressed_tensors.VllmCompressedTensorsConfig'>.
WARNING 04-26 22:57:12 [__init__.py:81] The quantization method 'fp8' already exists and will be overwritten by the quantization config <class 'tpu_inference.layers.vllm.quantization.fp8.VllmFp8Config'>.
WARNING 04-26 22:57:12 [__init__.py:81] The quantization method 'mxfp4' already exists and will be overwritten by the quantization config <class 'tpu_inference.layers.vllm.quantization.mxfp4.VllmMxfp4Config'>.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7b941f24c4a0>, trust_remote_code=False, seed=0, num_prompts=1000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='google/gemma-4-31B-it', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=8.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='result-short-rate8.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-8d3ff25b-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-26 22:57:15 [datasets.py:703] Sampling input_len from [1024, 1024] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 8.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1000/1000 [04:21<00:00,  3.82it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Request rate configured (RPS):           8.00      
Benchmark duration (s):                  261.83    
Total input tokens:                      1024000   
Total generated tokens:                  256000    
Request throughput (req/s):              3.82      
Output token throughput (tok/s):         977.73    
Peak output token throughput (tok/s):    1309.00   
Peak concurrent requests:                571.00    
Total token throughput (tok/s):          4888.64   
---------------Time to First Token----------------
Mean TTFT (ms):                          64292.95  
Median TTFT (ms):                        64592.15  
P99 TTFT (ms):                           126947.25 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          47.83     
Median TPOT (ms):                        45.14     
P99 TPOT (ms):                           79.33     
---------------Inter-token Latency----------------
Mean ITL (ms):                           47.83     
Median ITL (ms):                         38.26     
P99 ITL (ms):                            109.88    
==================================================